xml/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЧекККМ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкидкиНаценки</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НоменклатураНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХарактеристикаНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаБонусныхБалловКСписаниюВВалюте</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml/Catalogs/НастройкиРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НастройкиРМК</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассыККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИспользоватьБезПодключенияОборудования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml/Documents/ЧекККМ/Forms/ФормаДокументаРМК/Ext/Form/Module.bsl
&НаСервере
&Вместо("ОбновитьЗаголовокФормы")
Процедура Расш66_ОбновитьЗаголовокФормы()
	Заголовок = НСтр("ru = 'Продажа (ИП: %Организация%, Продавец: %Продавец%)'");
	Заголовок = СтрЗаменить(Заголовок, "%Организация%", Объект.Организация);
	Заголовок = СтрЗаменить(Заголовок, "%Продавец%", ?(ЗначениеЗаполнено(ТекущийПродавец),ТекущийПродавец, НСтр("ru='<Не выбран>'")));
	
	ЦветЗаголовка = Справочники.КассыККМ.Расш66_ПолучитьЦвет(Объект.КассаККМ);
	Если ЦветЗаголовка <> Неопределено Тогда
		Элементы.ГруппаВерхняяКоманднаяПанель.ЦветФона = ЦветЗаголовка;
	Иначе 
		Элементы.ГруппаВерхняяКоманднаяПанель.ЦветФона = Элементы.ГруппаВерхняяКоманднаяПанельРасширеннаяПодсказка.ЦветФона;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш66_ОтложитьПосле(Команда)
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", Неопределено);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьНовыйЧекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	РезультатОтложенДо = КонецДня(Объект.Дата + 24*60*60);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РезервироватьДо", РезультатОтложенДо);
	ДополнительныеПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		
	Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемОперацияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ДополнительныеПараметры = Новый Структура("ОповещениеПриЗавершении", Оповещение);
	
	//вызов стандартной процедуры конфигурации для откладывания чека с резервированием 
	ЗарезервироватьНаКлиенте(РезультатОтложенДо, ДополнительныеПараметры)
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПробитьЧекПослеПроведения")
Процедура Расш66_ПробитьЧекПослеПроведения(Проведен, ПараметрыОперацииФискализацииЧека)

	Если НЕ Проведен Тогда
		Возврат;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект);
    #Вставка
	Если ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования И ТипЗнч(ПараметрыКассыККМ) = Тип("ФиксированнаяСтруктура")Тогда
		ПодправитьПараметрыКассыККМ(ПараметрыКассыККМ);
	КонецЕсли;
	#КонецВставки
	Результат = МенеджерОборудованияУТКлиент.ОборудованиеПодключено(ПараметрыКассыККМ.ИдентификаторУстройства);

	Если Результат Или ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования Тогда

		Если Не ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования Тогда

			ПроверитьКодМаркировкиСредствамиККТ(ПараметрыОперацииФискализацииЧека);

		Иначе

			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);

			РезультатВыполнения = Новый Структура;
			РезультатВыполнения.Вставить("Результат", Истина);
			ПечатьЧека_Завершение(
			РезультатВыполнения,
			ДополнительныеПараметры);

		КонецЕсли;

	Иначе

		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Фискальное устройство не подключено. Чек не напечатан.'"));

		ВыполнитьОбработкуОповещения(
		ОписаниеОповещения,
		Новый Структура("ВыполненаОперацияНаУстройстве, ИзмененныеДанныеЗаписаны",
		Ложь, Ложь));

	КонецЕсли;

КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ПодправитьПараметрыКассыККМ(ПараметрыКассыККМ)
	// Вычислим запросом нужное подключаемое оборудование
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыКассыККМ.НастройкиРМК);
	Запрос.УстановитьПараметр("Организация", ПараметрыКассыККМ.Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиРМККассыККМ.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ИЗ
	|	Справочник.НастройкиРМК.КассыККМ КАК НастройкиРМККассыККМ
	|ГДЕ
	|	НастройкиРМККассыККМ.Ссылка = &Ссылка
	|	И НастройкиРМККассыККМ.КассаККМ.Владелец = &Организация
	|	И НЕ НастройкиРМККассыККМ.ИспользоватьБезПодключенияОборудования";
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		// подменим параметры в структуре
		НоваяСтруктура = Новый Структура;
		Для Каждого Элемент Из ПараметрыКассыККМ Цикл
			Если Элемент.Ключ = "ИспользоватьБезПодключенияОборудования" Тогда 
				НоваяСтруктура.Вставить(Элемент.Ключ, Ложь);
			ИначеЕсли Элемент.Ключ = "ИдентификаторУстройства" Тогда
				НоваяСтруктура.Вставить(Элемент.Ключ, Результат.ПодключаемоеОборудование);
			Иначе
				НоваяСтруктура.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		НовыйФиксСтруктура  = Новый ФиксированнаяСтруктура(НоваяСтруктура);
		ПараметрыКассыККМ = НовыйФиксСтруктура;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Расш66_ОтключитьЭквайринговыйТерминалПосле(Команда)
	Для Каждого Терминал Из ЭквайринговыеТерминалы Цикл
		Терминал.Значение.ИспользоватьБезПодключенияОборудования = Истина;
	КонецЦикла;
КонецПроцедуры
